The requested Measurement Line Offset would place the put the Measurement Line of the face boundaries.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId ExessiveBeltDistance { get; }
  Visual Basic
Public Shared ReadOnly Property ExessiveBeltDistance As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ ExessiveBeltDistance {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures CurtainWallFailures Class
  Autodesk.Revit.DB Namespace